[
  {
    "id": "o9n09799-znb",
    "createdAt": "2021-08-05T18:18:10.923Z",
    "updatedAt": "2021-08-05T18:18:10.923Z",
    "publishedAt": "2021-08-05T18:18:10.923Z",
    "revisedAt": "2021-08-05T18:18:10.923Z",
    "title": "プログラミングの独学者に必要な目標設定とは",
    "description": "メニューには ① プログラミングに関する目標を設定する",
    "body": "<p>プログラミングの独学だけでWebサービス開発ができるようになりたい人は目標設定はほぼマストだと考えます。<br><br>理由<br>・目標に応じて同じ題材であっても作るべき成果物の中身がまるっきり違うものとなる可能性があるため<br>・目標に応じて必要なツールや教材、学習の深度が異なってくるため<br>・目標に応じて独学が不適切な場合があるため<br><br>このように目標で必要なものが異なるため目標が不在であると効率的な独学が困難となります。<br>享楽的にプログラミングを楽しむだけなら問題はありませんが、プログラミングの独学で何らかのアクションを起こしていきたい人は必要です。<br><br>特にWebサービスを独学で作れるようになりたい人は「自分が欲しいから作ってみたい」のか「就職したいから作ってみたい」のかでしっかり区分けすべきです。<br><br>サービス開発は要点を抑えないととにかく時間が溶けていきます（運営者は技術力がないせいで溶かしまくりました）。<br>もちろん時間に余裕があれば別です。ただあわよくば就職したいなあ。と思っているのであれば面談してくれる人事を想定して機能を実装した方が効率的です。<br><br><span style=\"color:#030d1b\">①プログラミングに関する目標を設定する</span><br><span style=\"color:#030d1b\">→栄養サイトのWebサービスを作りたい（JavaScriptの技術を使ったWebサービスサイトを開発したい）</span><br><br>「プログラミングに興味があるけど独学でやるなら目標が」</p>",
    "time": "2021-08-05T17:00:00.000Z",
    "slug": "0yen-1",
    "genre": [
      "0yen"
    ]
  },
  {
    "id": "wtg-0yosqu-d",
    "createdAt": "2021-08-05T06:39:55.152Z",
    "updatedAt": "2021-08-05T06:39:55.152Z",
    "publishedAt": "2021-08-05T06:39:55.152Z",
    "revisedAt": "2021-08-05T06:39:55.152Z",
    "title": "野生の個人開発者がプログラミングの独学に使ってきたサイト",
    "description": "テスト",
    "body": "<p>テスト</p>",
    "time": "2021-08-04T17:00:00.000Z",
    "slug": "learn",
    "genre": [
      "0yen"
    ]
  },
  {
    "id": "3mfhsmaocy_e",
    "createdAt": "2021-08-05T06:16:46.248Z",
    "updatedAt": "2021-08-05T06:16:46.248Z",
    "publishedAt": "2021-08-05T06:16:46.248Z",
    "revisedAt": "2021-08-05T06:16:46.248Z",
    "title": "【実践者】自分はこうして0円でプログラミングを独学してきた",
    "description": "aaaa",
    "body": "<p>aaaa</p>",
    "time": "2021-08-04T17:00:00.000Z",
    "slug": "0yen-learn",
    "genre": [
      "0yen"
    ]
  },
  {
    "id": "mgzj1b6xx",
    "createdAt": "2021-08-01T15:02:17.356Z",
    "updatedAt": "2021-08-05T18:19:24.441Z",
    "publishedAt": "2021-08-01T15:15:22.268Z",
    "revisedAt": "2021-08-05T18:19:24.441Z",
    "title": "お金をかけずに独学でプログラミングを覚えてWebサービス開発できるようになるまでの手順",
    "body": "<p>個人開発をなりわいにするためWebサービス開発を独学でできるようになったあきふみです。<br><br>このサイトは<strong>「いずれ自分の好きなWebサービスを作ってみたいからプログラミングを独学で始めたいけど何から手をつけていいのかわからない」</strong>と悩んでいる人へ向けて自分の数年間の独学における実践経験に基づいて0から制作してみたサイトです。<br><br><strong>結論からいえば独学だけで好きなWebサービスを開発できるようにはなれます。</strong>とうぜん学習費用だって低く抑えられますが、\"ただし\"がいろいろつくのでそれは追々の解説です。<br>現に運営者自身が独学でただ作って終わりのものではなく拡張性とメンテナンス性を意識しながら開発ができるようになりました。<br><br>（正確にはその入り口に立てたくらいなので使いこなせているわけではないためまだ道なかばです。とはいえ今のレベル感だからこそ伝えられる初学者へのヒントがあると思い情報をまとめています。）<br><br><strong>「野良開発のススメ」の記事を一通り読むことで数年前の僕と同じようにネットに溢れている情報の中から自身にあった手法を選んで低コストで効果的な独習をしていけるようになる</strong>ことを目指しています。<br><br>ちまたに溢れている情報はかなり交錯していて、独学でもプログラミングができるよという声もあれば、独学のプログラミングの挫折率は○割以上だからコーチングをつけてもらった方が良い。<br><br>とかあっちこっちの情報だらけで困ってしまっても仕方がない状況だなと感じています。<br>それに追い討ちをかけるではありませんが、エンジニアさんは職人気質でこだわりを持つ人も多いため１８０度異なる意見が同じ技術感の人たちからも出やすかっりするのも一要因だったりすると考えます。<br><br>その上お互いのコードをレビューし批判する文化があること、コードを通じたコミュニケーションという一般的ではない方法であることもありトゲのある主張がネットで散見されてしまっているのかなと思います。<br>（そうした内容について関連リンクを貼る）<br>（おすすめの書籍、エンジニアの習性がわかる本を貼る）<br><br>ところで自分は特段、もの覚えがいいとかプログラミングの才能があったわけではありません。<br>むしろエンジニアを目指す層はインテリな方も多く、そうした方と比べたら効率の良いインプットができませんでした。おそらくアルゴリズム力や読解力、吸収スピードなどは相対的に悪いことでしょう。<br><br>それだけでなく技術記事のプラットフォーム（QiitaやZenn）などで１年のプログラミング経験で自分にも真似できない技術力を持っている２０歳に届くかどうかも怪しいような人たちもよく散見します。<br><br>ただし情報を取捨選択して自身に必要なものを選んで利用してそれを上手く利用するということに関してだけはメディアやECサイトを運営して何かしらのリサーチを何年も続けていたこともあり人並み以上には経験値がありました。<br>そのおかげで独学でサービス開発までできるようになったのかなと考えています。<br><br>「でも私にはそんな経験はないよ」という方が一般的です。<br><br>しかしプログラミング独学に必要な情報を取捨選択する方法というものはある程度は文章化することができますし再現性のあることですので読者にとって問題ではありません。<br>そこで情報が溢れているプログラミング初心者向けの情報に関しても自分なりの強みでもってして手順をまとめてみました。<br><br>// aboutページへのリンクを飛ばす<br>ところでお前は何者やねん。というところですが、<br><br>直近では 100g.jp と呼ばれる栄養系のサイトを１年ほどかけて少しずつ作りました。（使用した技術スタック：GatsbyJS, TypeScript, Firebase, microCMSなど）<br><br>職種としてのエンジニアではないため完全に野良開発です。<br>個人開発ドリームを体現したくて小規模ながら事業と呼んでも良いレベルに大きくさせていきたいのですがまずはご飯を個人開発だけでもぐもぐできるようになることを目下の目標としています。<br><br>それ以前には業務で小さなレベルの自動化をやったりJavaScriptだけで作った機能付きページをメディアに掲載したり、サーバーを使ったChrome拡張機能を開発したり、遊びでPHPでアプリ作りやPythonで簡単な統計つくったりとちょこまかとではありますがプログラミング自体は長らく続けていました。<br><br>このサイトを作った理由や目的は複数あります<br>・NextJSの学習用<br>・初学者に対する業界人の反応による問題意識と自分なりの解答<br>・独学者には後輩がいないためバーチャル後輩を想定することでバーチャル教育マンになりたい<br>・独学者は多いもののどこかしらの段階で就職する人が多数のため２年以上の単位で独学を継続していた人の発信をあまりみないため発信価値があると思った<br><br>(詳細はこちら)<br></p><h2 id=\"h2a47d688bd\">初心者がWebサービス開発まで独学でできるようになるまでの大まかな手順</h2><p>「野良開発のススメ」は大枠では下の手順に沿って記事を用意しています。下の手順をやっていくことで\"欲しいものがつくれる開発者としての基本的な力\"も身についてくるはずです。<br><br>①プログラミングに関する目標を設定する（例：○○なSNSを好奇心で作りたい、仕事で使うxxのアプリを実装したいといったことなど。それらに限らず就職するためにWebサービスを作りたい、趣味でプログラミングを始めたい、仕事で解決したい問題がピンポイントにある、なども当てはめることができる）<br>②目標に必要な技術や成果物を調べる<br>③目標に必要な技術や成果物を分解して一つひとつで何か作る<br>④分解した一つひとつで何かを作るという小さな目標のそれぞれで②と③を繰り返す（目標が大きなほど必要な繰り返しの回数は増えるかと）<br>⑤目標に必要な技術を習得して成果物を完成させる<br><br>後ほど順を追って解説します。あくまでWebサービス開発まで独学でできるようになるための比較的に便利な手順であって享楽的にプログラミングをやりたいだけの人には向かない手法です。<br><br>情報の取捨選択において目標があることは大前提となります。<br>例えば「同じWebサービスをつくる」であっても就職するためのWebサービスと個人開発としてのWebサービスでは力を入れるべき実装ポイントが異なるからです。<br><br>詳細は次ページでもある ①プログラミングに関する目標を設定する に記載しました。<br><br>就職するためのポートフォリオとしてWebサービスをつくるのであれば人事の見たい技術力（例えばCRUDやしっかりしたバリデーション、題材に適した精度のコードとなっているか、ただ言われて作られたような成果物でないかなど）を示したものでないと他の募集者と差別化できなかったりします。<br><br>その場合、自分の入社したい会社が開催している勉強会やカリキュラムに混じり自分に足りないものを現地の人たちに聞いてみることが最短ルートでしょう。<br><br>このようにそもそも目標がなければ効果的な手法を絞ることができません。<br>とはいえ８割以上の方はおそらく「目標っていわれてもあんまり思い浮かばないなー」と思います。<br>別に急いでいるわけではないけどそのうち就職もしたいし、Webサービスも開発してみたいし、趣味でアルゴリズム作ってみたいとかもあるし、と入り混じっている人の方がリアルかと。<br><br>そうした「目標わからん」な人に最適な目標は「プログラミング中毒者を目指す」です。<br>急に運営者は頭に虫がわいたのかな？と心配になったかもしれません。<br><br>しかし自分が何年もろくにお金も発生せずに（むしろ支出が大きくてマイナス）プログラミングをしこしこと続けられたのは大前提としていつ何時でもコードについて考えることがだいたい楽しい状態まで自身を調教できたことが大きいです。<br><br>いきなり文調が過激になってしまい困惑したかもしれませんが実際にそのような人間にできあがってしまったものに嘘をついても仕方がありません。<br><br>冗談っぽく聞こえますがポジティブなニュアンスで中毒者になるということは意識して毎日コードを触っていたことが功を成しているなとは思っています。<br>引くかもしれませんがたまに夢の中でもコードを読んでいたりします。<br><br>もちろ<br>（詳細はプログラミング中毒者のなり方）<br><br>話を戻して、だからこそ自身の学習状況に応じて指針を示してくれるスクールだったりが普及しているわけです。<br>「野良開発のススメ」ではぼんやりではあるけれどWebサービスをつくれるようになりたい人を想定していますがそうした人はある程度は目標を定めることができるかもしれません。<br><br><br>//<br>あくまで大まかな手順であり途中で手順を往復したり、目標を変えた方向転換をしたりすることは自分にもありました。<br>おそらくプログラミング学習に関するどのようなことであったとしても上のプロセスを通ることになると考えます。<br><br>ただし、自分の実践していた方法は\"帰納法\"に近いやり方です。つまり、欲しい結果から逆算して必要なものだけ抽出していくやり方です。<br>基礎から勉強すべきという\"演繹法\"の方といっていることは異なります。<br><br>//他の記事の材料とする<br>特に①に関しては各々によりけりです。\"手っ取り早くお金を稼ぎたい\"という層がもっとも多いかもしれませんがこのニーズに対して自分より濃い発信をしている人たちがたくさんいるためそちらを参考にした方が良いかもしれません。<br><br>// 他の記事の材料とする<br>価値観の問題でしかありませんが、\"演繹法\"を重視する方も少なくありません。つまり、成果物よりも先に基礎から積み重ねていく派です。<br>コンピューターサイエンスから学びましょう、トレンドに流されずに歴史の長く需要の高い言語をしっかりと身につけた上で新しい言語にもトライしようとか、算数からやり直しましょうや国家資格（基本情報技術者）をとりあえず取得しましょうなどです。<br><br>ニワトリが先か卵が先かの問題であり、どちらが正しいなんておごがましいことは言えませんが、自分はプログラミングの世界は学べることに尽きのこない\"沼\"だと思っていて基礎から学ぶにしても終わりの見えない暗闇の中のトンネルを歩き続けるような難しさがあると思います。<br><br>そして実際に\"プログラミングを現実世界で活用する\"ということを重視したならば\"帰納法\"としての学習手順が今後もメインとなることでしょう。<br><br>例えば知人から簡易的な機能の実装における業務委託の仕事をもらったことがありますが使ったことのない技術やライブラリであったため必要な機能だけを分解して考えて実装するのはまさしく\"帰納法\"によるアプローチそのものでした。<br><br>学校の勉学が得意だったタイプであれば基礎から学んでも楽しく続けられると思います。しかし独学は基本的にフィードバックがもらえるわけもなく目標の目安となる着地点も見えてきません。<br>また現実ではクライアントから<br><br>独学のデメリットの記事へ誘導する<br></p><h3 id=\"h61bec34996\">運営者が独学でWebサービス開発した手順</h3><p>「じゃあ偉そうにそんなことを言うお前はどうしたの？」といったところですが「野良開発のススメ」を作る以前に実際に自分がつくった栄養サイトを例に上げます。<br>雰囲気が伝われば良いので知らない用語は無視してもらって構いません。<br><br>①プログラミングに関する目標を設定する<br>→栄養サイトのWebサービスを作りたい（JavaScriptの技術を使ったWebサービスサイトを開発したい）<br><br>②目標に必要な技術や成果物を調べる<br>→使ったことのないGatsbyJSと呼ばれるフレームワーク、拡張性やメンテナンス性をより良くするTypeScript、会員登録する機能をサーバレスで実装するためのFirebaseなど、コード自動修正するためのライブラリ、デザインツールのXDなどを使いたい<br>（自分にできるできないは完全に無視して作りたいものに必要な機能や必要な言語を箇条書きする）<br><br><span style=\"color:#030d1b\">③目標に必要な技術や成果物を分解して一つひとつで何か作る</span><br>→GatsbyJS、TypeScript、Firebaseなどのそれぞれの技術を題材に簡単なアプリやサイトを作る<br>（またはGatsbyJS + Firebaseだけで組み合わせたサイトを作ってみたりも含む。そのために必要なチュートリアルや講座なども一通りこなす）<br><br><span style=\"color:#030d1b\">④分解した一つひとつで何かを作るという小さな目標のそれぞれで②と③を繰り返す</span><br>→GatsbyJSを使えるようになりたい。②GatsbyJSはReactとGraphQL、静的サイトの生成に関する知見が必要だからそれらを順番に学習しよう（ReactとGraphQL、静的サイトの生成に関する知見のそれぞれを習得するため③へ）<br>→TypeScriptを使えるようになりたい。TypeScriptのチュートリアルをやろう。いきなりReactにTypeScriptを使うのはわけがわからないからJavaScriptで練習しよう。③へ...以下略<br><br><span style=\"color:#030d1b\">⑤目標に必要な技術を習得して成果物を完成させる</span><br>→栄養サイトを完成させる<br><br><br>さらっと本日の献立はこちら、のようなノリで書いていますが言うは易し行うは難しです。上の順序を独学で通っていくためには都度、適切な学習ツールを見つけてはこなしていくことを継続していく必要があります。<br><br>あくまで分かりやすい手順として紹介していますが実際の生々しい流れでいえば、いきなり①から⑤を始めてみてデザインだけはできたけどその後は手が全く動かなかった→やっぱり②と③、④の繰り返しだ。そして一旦また⑤へ行ってやっぱりダメだから...といった流れで何度か行き来しました。<br><br>Twitterにいるエンジニアなどはさらっと複数の技術を組み合わせて実装して「こんなのできました〜」と軽々しくやってのけていますがそれを実現させるための下積みの量が多いおかげで学習時間を大幅に省略しながら実装できています。<br><br>ピカソの１０秒で描いた落書きはピカソの人生を費やして身につけた技術による１０秒の絵だからクオリティが高い絵である。と言う考え方に少し近い？かもしれません。<br><br>ただし、センスのある人はそんな一つひとつでしっかりアプリを作ったりせずともいきなりさまざまな技術を組み合わせてもさらっと実装できてしまったりします。<br>こればっかりはどうしようもないことです。少なくともレアポケモンであり特別ですので変に比べて落ち込むのはやめておきましょう。<br><br>運営者もそのようなセンスを持ち合わせていないパンピーであったため時間はかかりましたが一つひとつの技術ごとに開発を行い技術を覚えていきました。<br>結果として個人でやるにはオーバーエンジニアリング（やりすぎ）な技術を使っていると思っていますがある程度は高品質なコードで開発できるようになりたかったため、そちらの方がやりがいを感じられて楽しいため選びました。<br></p><h2 id=\"h91bcacd6d3\">実践に手を動かしてみよう</h2><p>①プログラミングに関する目標を設定する<br>②目標に必要な技術や成果物を調べる<br>③目標に必要な技術や成果物を分解して一つひとつで何か作る<br>④分解した一つひとつで何かを作るという小さな目標のそれぞれで②と③を繰り返す<br>⑤目標に必要な技術を習得して成果物を完成させる<br><br>それぞれの手順を実践してみてください。<br>といっても項目ごとにポイントを解説しているのでご安心を。次のページは「①プログラミングに関する目標を設定する」です。<br><br>前のページへ 次のページへ<br><br><br><br>独学プログラミングは情報を組み立てて個人最適化すればできる<br>【帰納法のススメ】プログラミング独学は何からすべき？<br>英語で情報あさりのススメ<br>科学的に効果のある独学でできる勉強法の一覧<br>辛口版のプログラミングの独学に必要なモノ<br></p><h2 id=\"hbaf64a5b48\">独学プログラミングは情報を組み立てて個人最適化すればできる</h2><p>十徳ツールのようにある学習ツールをどのように自身に組み合わせて自身の目標を達成するために上手に使うことができれば独学でも十分にプログラミング学習をして個人でWebサービス開発ができるようにもなります。<br>自身が色々な学習ツールを利用してWebサービス開発できるようになった口なので。<br><br>これは自分だけがいっていることではありません。<br>「独学でプログラミングはできる」「スクールに通わずともプログラミングを覚えることができる」と主張するエンジニアの方は根拠として少し検索すれば色々な学習ツールが出てくるためそれらを触りながら自分で何かを作っていけばそれなりにコードが書けるようになる。<br>といったことを言っています。<br></p><h2 id=\"h24d6fa823e\">フロントエンドは特に英語情報が強い</h2><p><br></p>",
    "time": "2021-07-31T17:00:00.000Z",
    "thumbnail": {
      "url": "https://images.microcms-assets.io/assets/ae335419fcf84360abab9385ede92248/cdd6c00e5a0b4a779f4f0c7c66afda72/8.1.jpg",
      "height": 543,
      "width": 880
    },
    "slug": "0yen",
    "genre": [
      "0yen"
    ]
  }
]